app/controllers/comments_controller.rb

SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "experiments".* FROM "experiments" WHERE "experiments"."proposal_id" = $1 AND "experiments"."id" = $2 LIMIT 1  [["proposal_id", 1], ["id", 1]]
INSERT INTO "comments" ("content", "stage", "experiment_id", "proposal_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "OK"], ["stage", "Equipment"], ["experiment_id", 1], ["proposal_id", 1], ["created_at", "2015-10-27 14:08:58.386884"], ["updated_at", "2015-10-27 14:08:58.386884"]]
---
  def create
    form_params = params["comment"]
    @proposal = Proposal.find(params[:proposal_id])
    @experiment = @proposal.experiments.find_by(id: params[:experiment_id])
    @comment = Comment.create(content: form_params[:content], stage: form_params[:stage], commenter_id: session[:user_id], experiment_id: params[:experiment_id], proposal_id: params[:proposal_id])