app/controllers/experiments_controller.rb

  def new
    @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 52]]

  def create
    @proposal = Proposal.find(params[:proposal_id])
    @experiment = @proposal.experiments.build(experiment_params)
      if @experiment.save
---
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "experiments" ("description", "proposal_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "test"], ["proposal_id", 1], ["created_at", "2015-10-26 22:26:29.031280"], ["updated_at", "2015-10-26 22:26:29.031280"]]

  def show
    @user = User.find(session[:user_id])
    @proposal = Proposal.find(params[:proposal_id])
    @experiment = Experiment.includes(:comments).find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "experiments".* FROM "experiments" WHERE "experiments"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @experiment = Experiment.find(params[:id])
---
SELECT  "experiments".* FROM "experiments" WHERE "experiments"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @experiment = Experiment.find(params[:id])
    if @experiment.update(experiment_params)
---
SELECT  "experiments".* FROM "experiments" WHERE "experiments"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "experiments" SET "title" = $1, "updated_at" = $2 WHERE "experiments"."id" = $3  [["title", "UPDATE TEST"], ["updated_at", "2015-10-27 13:27:46.123979"], ["id", 1]]

  def destroy
    @experiment = Experiment.find(params[:id])
    @experiment.destroy
---
SELECT  "experiments".* FROM "experiments" WHERE "experiments"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "experiments" WHERE "experiments"."id" = $1  [["id", 3]]