app/controllers/proposals_controller.rb

SELECT "proposals".* FROM "proposals"
---
  def index
    @proposals = Proposal.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 51]]
---
  def new
    @proposal = Proposal.new
    @current_user = User.find(session[:user_id])

INSERT INTO "proposals" ("title", "summary", "hypothesis", "department", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 51]]
UPDATE "proposals" SET "faculty_id" = $1, "updated_at" = $2 WHERE "proposals"."id" = $3  [["faculty_id", 51], ["updated_at", "2015-10-27 19:24:47.607974"], ["id", 51]]
---
  def create
    @proposal = Proposal.create!(proposal_params)
    @proposal.faculty = User.find_by(id: session[:user_id])
    @proposal.save

SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 51]]
---
  def edit
    @proposal = Proposal.find(params[:id])
    @current_user = User.find_by(id: session[:user_id])

SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "proposals" SET "hypothesis" = $1, "updated_at" = $2 WHERE "proposals"."id" = $3
---
  def update
    @proposal = Proposal.find(params[:id])
    if @proposal.update_attributes(proposal_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @current_user = User.find(session[:user_id])
    @proposal = Proposal.find(params[:id])

SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "proposals" WHERE "proposals"."id" = $1  [["id", 1]]
---
  def destroy
    @proposal = Proposal.find(params[:id])
    @proposal.destroy