app/controllers/users_controller.rb

INSERT INTO "users" ("password_digest", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["password_digest", "$2a$10$lev.HdqDkT/xqwTN/RtjrOKKUtVgjTBNIOCibyHBrX.UkJUrDZlou"], ["created_at", "2015-10-27 13:35:04.194284"], ["updated_at", "2015-10-27 13:35:04.194284"]]
---
  def create
    @user = User.new(user_params)
    if @user.save && @user.valid?